let userAvg = prompt("معدل مورد نظر را وارد کنید ")
// معدل کاربر را دریافت کرده و سپس سطح او را تعیین کنید

// A برای معدل 18 الی 20 سطح
// B برای معدل 15 الی 17 سطح
// C برای معدل 12 الی 14 سطح
// معدل کمتر از 12 مشروط میشه :(

switch(userAvg){
        case '18':
        case '19':
        case '20':
          alert( 'سطح شما : A  ' );
        break;
        case '15':
        case '16':
        case '17':
          alert( 'سطح شما :B  ' );
        break;
        case '12':
        case '13':
        case '14':
          alert( 'سطح شما : C  ' );
        break;
        default:
            alert( ' معدل کمتر از 12 مشروط میشه :(' );
}